<?php

use Illuminate\Database\Seeder;

class AdminInitSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \App\Models\Admin\AdminUser::truncate();
        \App\Models\Admin\Permission::truncate();
        \DB::select(
            <<<SQL
                INSERT INTO `admin_permissions` (`id`, `name`, `label`, `description`, `cid`, `icon`, `created_at`, `updated_at`)
VALUES
	(1, 'admin.permission', '权限管理', '', 0, 'fa-users', '2016-05-21 10:06:50', '2016-06-22 13:49:09'),
	(2, 'admin.permission.index', '权限列表', '', 1, '', '2016-05-21 10:08:04', '2016-05-21 10:08:04'),
	(3, 'admin.permission.create', '权限添加', '', 1, '', '2016-05-21 10:08:18', '2016-05-21 10:08:18'),
	(4, 'admin.permission.edit', '权限修改', '', 1, '', '2016-05-21 10:08:35', '2016-05-21 10:08:35'),
	(5, 'admin.permission.destroy ', '权限删除', '', 1, '', '2016-05-21 10:09:57', '2016-05-21 10:09:57'),
	(6, 'admin.role.index', '角色列表', '', 1, '', '2016-05-23 10:36:40', '2016-05-23 10:36:40'),
	(7, 'admin.role.create', '角色添加', '', 1, '', '2016-05-23 10:37:07', '2016-05-23 10:37:07'),
	(8, 'admin.role.edit', '角色修改', '', 1, '', '2016-05-23 10:37:22', '2016-05-23 10:37:22'),
	(9, 'admin.role.destroy', '角色删除', '', 1, '', '2016-05-23 10:37:48', '2016-05-23 10:37:48'),
	(10, 'admin.user.index', '用户管理', '', 1, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(11, 'admin.user.create', '用户添加', '', 1, '', '2016-05-23 10:39:21', '2016-06-22 13:49:29'),
	(12, 'admin.user.edit', '用户编辑', '', 1, '', '2016-05-23 10:39:52', '2016-05-23 10:39:52'),
	(13, 'admin.user.destroy', '用户删除', '', 1, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36'),
    (14, 'admin.fabu', '发布管理', '', 0, 'fa-users', '2016-05-21 10:06:50', '2016-06-22 13:49:09'),
	(15, 'admin.task.index', '任务列表', '', 14, '', '2016-05-21 10:08:04', '2016-05-21 10:08:04'),
	(16, 'admin.task.create', '任务添加', '', 14, '', '2016-05-21 10:08:18', '2016-05-21 10:08:18'),
	(17, 'admin.task.edit', '任务修改', '', 14, '', '2016-05-21 10:08:35', '2016-05-21 10:08:35'),
	(18, 'admin.task.destroy ', '任务删除', '', 14, '', '2016-05-21 10:09:57', '2016-05-21 10:09:57'),
	(19, 'admin.information.index', '消息列表', '', 14, '', '2016-05-23 10:36:40', '2016-05-23 10:36:40'),
	(20, 'admin.information.create', '消息添加', '', 14, '', '2016-05-23 10:37:07', '2016-05-23 10:37:07'),
	(21, 'admin.information.edit', '消息修改', '', 14, '', '2016-05-23 10:37:22', '2016-05-23 10:37:22'),
	(22, 'admin.information.destroy', '消息删除', '', 14, '', '2016-05-23 10:37:48', '2016-05-23 10:37:48'),
	(23, 'admin.exposure.index', '曝光台管理', '', 14, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(24, 'admin.exposure.create', '曝光台添加', '', 14, '', '2016-05-23 10:39:21', '2016-06-22 13:49:29'),
	(25, 'admin.exposure.edit', '曝光台编辑', '', 14, '', '2016-05-23 10:39:52', '2016-05-23 10:39:52'),
	(26, 'admin.exposure.destroy', '曝光台删除', '', 14, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36'),
	(27, 'admin.fabu', '检查管理', '', 0, 'fa-users', '2016-05-21 10:06:50', '2016-06-22 13:49:09'),
	(29, 'admin.check.create', '检查添加', '', 27, '', '2016-05-23 10:39:21', '2016-06-22 13:49:29'),
	(30, 'admin.check.edit', '检查编辑', '', 27, '', '2016-05-23 10:39:52', '2016-05-23 10:39:52'),
	(31, 'admin.check.destroy', '检查删除', '', 27, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36'),
	(32, 'admin.check1.index', '综合楼安全检查', '', 27, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(33, 'admin.check2.index', '营业厅安全检查', '', 27, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(34, 'admin.check3.index', '通信基站安全检查', '', 27, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(35, 'admin.check4.index', '工程建设施工检查', '', 27, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(36, 'admin.feedback.index', '整改进度', '', 27, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36'),
	(37, 'admin.expired.index', '超时预警', '', 27, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36'),
	(40, 'admin.target.index', '检查对象管理', '', 27, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(41, 'admin.target.create', '检查对象添加', '', 27, '', '2016-05-23 10:39:21', '2016-06-22 13:49:29'),
	(42, 'admin.target.edit', '检查对象编辑', '', 27, '', '2016-05-23 10:39:52', '2016-05-23 10:39:52'),
	(43, 'admin.target.destroy', '检查对象删除', '', 27, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36'),
	(50, 'admin.subitem.index', '检查项管理', '', 27, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(51, 'admin.subitem.create', '检查项添加', '', 27, '', '2016-05-23 10:39:21', '2016-06-22 13:49:29'),
	(52, 'admin.subitem.edit', '检查项编辑', '', 27, '', '2016-05-23 10:39:52', '2016-05-23 10:39:52'),
	(53, 'admin.subitem.destroy', '检查项删除', '', 27, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36');
	
	
SQL
        );
        $admin = new \App\Models\Admin\AdminUser();
        $admin->
        id = 1;
        $admin->name = 'root';
        $admin->email = 'root@admin.com';
        $admin->password = bcrypt('root');
        $admin->save();
    }
}
